In [1]:
import pandas as pd
df=pd.read_csv("weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [3]:
df.sample(n=3)

       date      city  temperature  humidity
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
0  5/1/2017  new york           65        56

# random_state

In [6]:
df.sample(n=3,random_state=100)

       date      city  temperature  humidity
1  5/2/2017  new york           66        58
6  5/1/2017   beijing           80        26
5  5/3/2017    mumbai           82        85

In [10]:
df["temperature"].sample(n=5)

2    68
3    75
0    65
8    79
5    82
Name: temperature, dtype: int64

# fetch 50% of data from the dataset

In [14]:
df.sample(frac=0.50)

       date      city  temperature  humidity
6  5/1/2017   beijing           80        26
3  5/1/2017    mumbai           75        80
2  5/3/2017  new york           68        60
5  5/3/2017    mumbai           82        85

# replace

In [20]:
# df.sample(n=5,replace=True)
df.sample(n=5,replace=False)

       date      city  temperature  humidity
4  5/2/2017    mumbai           78        83
0  5/1/2017  new york           65        56
2  5/3/2017  new york           68        60
1  5/2/2017  new york           66        58
6  5/1/2017   beijing           80        26

In [22]:
df.sample(n=2,axis=1)

   humidity      city
0        56  new york
1        58  new york
2        60  new york
3        80    mumbai
4        83    mumbai
5        85    mumbai
6        26   beijing
7        30   beijing
8        35   beijing

# Weights

In [29]:
w=[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9]
df.sample(n=3,weights=w)

       date     city  temperature  humidity
4  5/2/2017   mumbai           78        83
8  5/3/2017  beijing           79        35
7  5/2/2017  beijing           77        30

In [33]:
print(df["date"].dtype)

print(type(df["date"]))

object
<class 'pandas.core.series.Series'>